{
  "pages": [
    {
      "name": "page1",
      "elements": [
        {
          "type": "html",
          "name": "question1",
          "html": "<p><strong>Title of Study:</strong> Evaluating the Effect of Programming Support on Novice Programmers</p>\n<p><strong>(eIRB #</strong>20310<strong>)</strong></p>\n<p><strong>Principal Investigator:</strong> Wengran Wang, <a target=\"_blank\" href=\"mailto:wwang33@ncsu.edu\">wwang33@ncsu.edu</a>, 9849203030 </p>\n<p><strong>Funding Source</strong>: National Science Foundation</p>\n<p><strong>Faculty Point of Contact:</strong> Dr. Thomason William Price, twprice@ncsu.edu, (919) 590-9526</p>\n<h2 id=\"-what-are-some-general-things-you-should-know-about-research-studies-\"><strong>What are some general things you should know about research studies?</strong></h2>\n<p>You are invited to take part in a research study. Your participation in this study is voluntary. You have the right to be a part of this study, to choose not to participate, and to stop participating at any time without penalty. The purpose of this research study is to gain a better understanding of what kinds of help and support are useful to people when learning to program. We will do this through asking you to complete some programming related tasks, and answer some survey and interview questions.</p>\n<p>You are not guaranteed any personal benefits from being in this study. Research studies also may pose risks to those who participate. You may want to participate in this research because you want to get a chance to learn about block-based programming languages and practice programming problems or you want to help the research team to develop tools that assist students during programming. You may not want to participate in this research because you are busy with your classes and do not have time to make it.</p>\n<p>Specific details about the research in which you are invited to participate are contained below. If you do not understand something in this form, please ask the researcher for clarification or more information. A copy of this consent form will be provided to you. If, at any time, you have questions about your participation in this research, do not hesitate to contact the researcher(s) named above or the NC State IRB office. The IRB office’s contact information is listed in the <em>What if you have questions about your rights as a research participant?</em> section of this form.</p>\n<h2 id=\"-what-is-the-purpose-of-this-study-\"><strong>What is the purpose of this study?</strong></h2>\n<p>The purpose of the study is to gain a better understanding of what kinds of help and support are useful to people learning to program and what factors affect how useful support is. The end-goal of the study is to develop tools that help students learn to program by providing automated help.</p>\n<h2 id=\"-am-i-eligible-to-be-a-participant-in-this-study-\"><strong>Am I eligible to be a participant in this study?</strong></h2>\n<p>There will be approximately 10 - 150 participants in this study.</p>\n<p>In order to be a participant in this study, you must agree to be in the study and fulfill all of the following requirements: 1) You are currently enrolled as an undergraduate student at NCSU. 2) You are at least 18 years old. 3) You are comfortable speaking out loud in English while you complete a programming exercise. 4) You are currently taking one of the following courses: CSC200, CSC110, CSC111, CSC112, CSC113, CSC116, E115.</p>\n<p>You cannot participate in this study if you do not want to be in the study or do not fulfill one or more of the above 4 requirements.</p>\n<h2 id=\"-what-will-happen-if-you-take-part-in-the-study-\"><strong>What will happen if you take part in the study?</strong></h2>\n<p>If you agree to participate in this study, you will have the option to 1) attend the study online over Zoom, or 2) attend the study offline. </p>\n<p><strong>1)</strong> <strong>Attending the study online over Zoom:</strong></p>\n<p>If you choose to attend the study online over Zoom, you will attend a 1-1 or 1-to-many tutoring session over Zoom. You will be directed to a calendar where you can sign up for a 90 minute appointment slot. The appointment will be held in Zoom, where you will meet with one or more interviewers. There may also be other participants. You will work through the following steps:</p>\n<ol>\n<li><p>Complete a short pre-survey.</p>\n</li>\n<li><p>Learn a tutorial of the programming environment.</p>\n</li>\n<li><p>Complete a short pre-assessment.</p>\n</li>\n<li><p>Work through one or more programming-related problems.</p>\n</li>\n<li><p>Complete a short post-assessment and a short post-survey.</p>\n</li>\n<li><p>We may then conduct a short semi-structured interview, asking you to tell us about your experiences.</p>\n</li>\n</ol>\n<p><strong>Data collection:</strong><br>During the study, the following information will be securely collected and used for research purposes:</p>\n<ol>\n<li><p>Log data from your programming environment, which captures your interactions with the programming environment, such as the code that you write and how you use help features.</p>\n</li>\n<li><p>Your survey and assessment responses.</p>\n</li>\n<li>if you consent to voice and screen recordings, we will collect your voice and computer screens, we will not collect them if you do not consent to voice and screen recordings or choose to attend the study offline. </li>\n</ol>\n<p><strong>2)Attending the study offline:</strong></p>\n<p>If you choose to attend the study offline, you will work through steps 1-5. We will only collect data from sources 1 and 2.</p>\n<p>The total amount of time that you will be participating in this study is around 90 minutes.</p>\n<p>We are requesting permission to use the data from steps 1-6 for research. However, regardless if you agree to allow us to use your data, you may still obtain extra credit by completing the steps 1-5 as part of your course.</p>\n<h2 id=\"-recording-and-images-\"><strong>Recording and images</strong></h2>\n<p>As a part of this research, we would like your consent for us to collect audio and your screen video recordings.</p>\n<p>If you consent to recording:</p>\n<p>Audio and computer screen may be recorded during the session. This will include your utterance as you think aloud while working, as well as during the interview. We may record your computer screen during the programming exercises. We will not record any facial data/video.</p>\n<p>If you do not consent to audio and screen recording:</p>\n<p>You cannot attend the online Zoom programming sessions. You can still participate the study by completing the offline versions of the exercises. but we will not collect your audio and screen video data. </p>\n"
        },
        {
          "type": "radiogroup",
          "name": "audio_consent",
          "title": "Please confirm that you understand and consent to this recording.",
          "isRequired": true,
          "choices": [
            {
              "value": "yes",
              "text": "Yes, I consent to screen and audio recording."
            },
            {
              "value": "no",
              "text": "No, I do not consent to screen and audio recording."
            }
          ]
        },
        {
          "type": "html",
          "name": "question3",
          "html": "<h2 id=\"-risks-and-benefits-\"><strong>Risks and benefits</strong></h2>\n<p>There are minimal risks associated with participation in this research.</p>\n<p>By participating in this study, you will have the chance to learn about block-based programming environments and practice programming problems, which may improve your programming ability. The indirect benefit of participating is this study will be that you will aid the researchers in developing tools to assist students in learning to program.</p>\n<h2 id=\"-right-to-withdraw-your-participation-\"><strong>Right to withdraw your participation</strong></h2>\n<p>You can stop participating in this study at any time for any reason. In order to stop your participation, please contact the PI Wengran Wang, at <a target=\"_blank\" href=\"mailto:wwang33@ncsu.edu\">wwang33@ncsu.edu</a> or at 9849203030. If you choose to withdraw your consent and to stop participating in this research, your data will be discarded.</p>\n<h2 id=\"-confidentiality-personal-privacy-and-data-management-\"><strong>Confidentiality, personal privacy, and data management</strong></h2>\n<p>Trust is the foundation of the participant/researcher relationship. Much of that principle of trust is tied to keeping your information private and in the manner that we have described to you in this form. The information that you share with us will be held in confidence to the fullest extent allowed by law. Protecting your privacy as related to this research is of utmost importance to us.</p>\n<p>How we manage, protect, and share your data are the principal ways that we protect your personal privacy. Data generated about you in this study will be de-identified.</p>\n<p><strong>De-identified.</strong> De-identified data is information or bio-specimen(s) that at one time could directly identify you, but that we have recorded this data so that your identity is separated from the data. we will have a master list with your code and real name that we can use to link to your data, and this list will be destroyed after data is collected. While we might be able to link your identity to your data at earlier stages in the research, when the research concludes, there will be no way your real identity will be linked to the data we publish.</p>\n<p>Data that will be shared with others about you will be de-identified because we will collect your name, as well as audio and video recordings, but we will not report or publish your name, or video data. We may report transcribed audio data, but we will refer to you using a pseudonym, not your name.</p>\n<h2 id=\"-compensation-\"><strong>Compensation</strong></h2>\n<p>You will receive extra-credit in your course by completing steps 1-5 listed in Section “What will happen if you take part in the study”, regardless if you choose to participate to the study or not.</p>\n<p>If you choose to not participate to the study, you will receive extra-credit by completing steps 1-5. But we will not collect data from it. </p>\n<h2 id=\"-what-if-you-are-an-ncsu-student-\"><strong>What if you are an NCSU student?</strong></h2>\n<p>Your participation in this study is not a course requirement and your participation or lack thereof, will not affect your class standing or grades at NC State. </p>\n<h2 id=\"-what-if-you-are-an-ncsu-employee-\"><strong>What if you are an NCSU employee?</strong></h2>\n<p>Your participation in this study is not a requirement of your employment at NCSU, and your participation or lack thereof, will not affect your job. </p>\n<h2 id=\"-what-if-you-have-questions-about-this-study-\"><strong>What if you have questions about this study?</strong></h2>\n<p>If you have questions at any time about the study itself or the procedures implemented in this study, you may contact the researcher: Wengran Wang (<a target=\"_blank\" href=\"mailto:wwang33@ncsu.edu\">wwang33@ncsu.edu</a>, 9849203030) and the Faculty Sponsor: Dr. Thomason William Price (twprice@ncsu.edu, 9196192390)</p>\n<h2 id=\"-what-if-you-have-questions-about-your-rights-as-a-research-participant-\"><strong>What if you have questions about your rights as a research participant?</strong></h2>\n<p>If you feel you have not been treated according to the descriptions in this form, or your rights as a participant in research have been violated during the course of this project, you may contact the NC State IRB (Institutional Review Board) Office. An IRB office helps participants if they have any issues regarding research activities. You can contact the NC State IRB Office via email at <a target=\"_blank\" href=\"mailto:irb-director@ncsu.edu\">irb-director@ncsu.edu</a> or via phone at (919) 515-8754.</p>\n"
        },
        {
          "type": "radiogroup",
          "name": "consent",
          "title": "Consent To Participate:",
          "isRequired": true,
          "choices": [
            {
              "value": "yes",
              "text": " By signing this consent form electronically, I am aﬃrming that I have read and understand the above information. All of the questions that I had about this research have been answered. I have chosen to participate in this study with the understanding that I may stop participating at any time without penalty or loss of beneﬁts to which I am otherwise entitled. I am aware that I may revoke my consent at any time."
            },
            {
              "value": "no",
              "text": "I do not consent to participate in the study."
            }
          ]
        }
      ],
      "title": "Adult Informed Consent Form"
    }
  ],
  "showQuestionNumbers": "off"
}
