{
  "pages": [
    {
      "name": "page1",
      "elements": [
        {
          "type": "html",
          "name": "question1",
          "html": "Recall your experience constructing the 7 mini-tasks from 3 sample tasks from Step 7, using the decomposition system, and answer the following three questions. "
        },
        {
          "type": "text",
          "name": "reflection_survey_1",
          "title": "Describe a scenario when you used the program decomposition system to understand a sample project and find the corresponding code for a mini-task. In what ways did it help you find code that you were looking for? Describe a specific example.",
          "isRequired": true,
          "validators": [
            {
              "type": "text",
              "text": "30"
            }
          ]
        },
        {
          "type": "text",
          "name": "reflection_survey_2",
          "title": "Describe a scenario where you've encountered a challenge or difficulty when completing the decomposition by sequence task. How did you overcome the challenge?",
          "isRequired": true,
          "validators": [
            {
              "type": "text",
              "minLength": 30
            }
          ]
        },
        {
          "type": "text",
          "name": "reflection_survey_3",
          "title": "Describe your strategy for finding code from the sample projects.",
          "isRequired": true,
          "validators": [
            {
              "type": "text",
              "minLength": 30
            }
          ]
        },
        {
          "type": "rating",
          "name": "reflection_survey_4",
          "title": "After finding the code snippets for the 7 mini-tasks, how helpful were the 7 code snippets for you when using them to complete the integration task from Step 8?",
          "isRequired": true
        },
        {
          "type": "radiogroup",
          "name": "reflection_survey_5",
          "title": "Do you think the integration task on Step 8 was made easier after using the system and the decomposition by sequence strategy, comparing to programming the project from scratch?",
          "isRequired": true,
          "choices": [
            {
              "value": "item1",
              "text": "Yes, the system and the strategy was helpful."
            },
            {
              "value": "item2",
              "text": "No, I think starting from scratch should be more or less the same. "
            }
          ]
        },
        {
          "type": "text",
          "name": "question5",
          "visibleIf": "{reflection_survey_5} notempty",
          "title": "Explain why.",
          "isRequired": true,
          "validators": [
            {
              "type": "text",
              "minLength": 30
            }
          ]
        }
      ],
      "title": "Reflection",
      "description": "Reflect on your learning of Decomposition By Sequence."
    }
  ],
  "showQuestionNumbers": "off",
  "checkErrorsMode": "onValueChanged"
}
